app/Controllers/PostCon.php

public function getdata()

{

try

{

$post = new Post();

$user = $post->withDeleted()->findAll();
---
SELECT *
FROM `posts`

public function insert()

{

try

{

$post = new Post();

$data['name'] = "test";

$post->save($data);
---
INSERT INTO `posts` (`name`) VALUES ('test')

public function updatedata()

{

try

{

$post = new Post();

$post->set('name', 'tessssteing');

$post->where('id', 2);

$post->update();
---
UPDATE `posts` SET `name` = 'tessssteing'
WHERE `id` = 2

public function deletePost()

{

try

{

$post = new Post();

$post->where('id', 1)->delete();
---
DELETE FROM `posts`
WHERE `id` = 1